<a href="https://colab.research.google.com/github/ckalibsnelson/Node-Lite/blob/master/FDNY_Node_Lite_Exercise_(10_1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#Import relevant libraries: Pandas and Numpy
import pandas as pd
#Pandas is for data manipulation and analysis, such as removing null values
import numpy as np
#Useful for mathematical functionality, such as sum

In [2]:
#Create a dataframe of the fire department of New York City (FDNY) dataset
#Location of Firehouses
fdny = pd.read_csv('https://data.cityofnewyork.us/api/views/hc8x-tcnd/rows.csv?accessType=DOWNLOAD')
#View the first five results of the data
fdny.head()

                                        FacilityName  ...                                                NTA
0                                 Engine 4/Ladder 15  ...  Battery Park City-Lower Manhattan             ...
1                                Engine 10/Ladder 10  ...  Battery Park City-Lower Manhattan             ...
2                                           Engine 6  ...  Battery Park City-Lower Manhattan             ...
3  Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...  ...  SoHo-TriBeCa-Civic Center-Little Italy        ...
4                                           Ladder 8  ...  SoHo-TriBeCa-Civic Center-Little Italy        ...

[5 rows x 12 columns]

In [3]:
#view the type of the object
type(fdny)

pandas.core.frame.DataFrame

In [4]:
#View the last five results of the data
fdny.tail()

                          FacilityName  ...                                                NTA
213  Engine 162/Ladder 82/Battalion 23  ...  Great Kills                                   ...
214               Engine 167/Ladder 87  ...  Annadale-Huguenot-Prince's Bay-Eltingville    ...
215               Engine 164/Ladder 84  ...  Rossville-Woodrow                             ...
216          Engine 168/EMS Station 23  ...  Rossville-Woodrow                             ...
217               Engine 151/Ladder 76  ...  Charleston-Richmond Valley-Tottenville        ...

[5 rows x 12 columns]

In [5]:
#Understand how many columns (items) and rows (features) there
fdny.shape

(218, 12)

In [6]:
#View statistics of data
fdny.describe()

           Postcode    Latitude  ...           BIN           BBL
count    213.000000  213.000000  ...  2.130000e+02  2.130000e+02
mean   10783.774648   40.719125  ...  2.900421e+06  2.849843e+09
std      556.522394    0.083674  ...  1.306104e+06  1.285511e+09
min    10001.000000   40.512518  ...  1.000867e+06  1.000350e+09
25%    10304.000000   40.663404  ...  2.003268e+06  2.025140e+09
50%    11103.000000   40.715147  ...  3.064786e+06  3.024650e+09
75%    11231.000000   40.774505  ...  4.090228e+06  4.032940e+09
max    11695.000000   40.892803  ...  5.154879e+06  5.080400e+09

[8 rows x 8 columns]

In [7]:
#How to show stats for categorical columns
fdny.describe(include=['O'])

                              FacilityName  ...                                                NTA
count                                  218  ...                                                213
unique                                 218  ...                                                143
top     Engine 225/Ladder 107/Battalion 39  ...  SoHo-TriBeCa-Civic Center-Little Italy        ...
freq                                     1  ...                                                  5

[4 rows x 4 columns]

In [8]:
#For more granular information about the data
fdny.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 218 entries, 0 to 217
Data columns (total 12 columns):
FacilityName          218 non-null object
FacilityAddress       218 non-null object
Borough               218 non-null object
Postcode              213 non-null float64
Latitude              213 non-null float64
Longitude             213 non-null float64
Community Board       213 non-null float64
Community Council     213 non-null float64
Census Tract          213 non-null float64
BIN                   213 non-null float64
BBL                   213 non-null float64
NTA                   213 non-null object
dtypes: float64(8), object(4)
memory usage: 20.5+ KB

In [9]:
# use .iloc to slices via the position of the passed integers
# : means all, 0:7 means from 0 to 7
fdny.iloc[: , 0:7].head()

                                        FacilityName  ... Community Board
0                                 Engine 4/Ladder 15  ...             1.0
1                                Engine 10/Ladder 10  ...             1.0
2                                           Engine 6  ...             1.0
3  Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...  ...             1.0
4                                           Ladder 8  ...             1.0

[5 rows x 7 columns]

In [10]:
#Show the title of each column(feature)
fdny.columns

#Census Tract: A census tract, census area, census district or meshblock is a geographic region defined for the purpose of taking a census.
#BIN = Building Information Number
#BBL = Borough Block & Lot
#NTA = Neighborhood Tabulation Area

Index(['FacilityName', 'FacilityAddress', 'Borough', 'Postcode', 'Latitude',
       'Longitude', 'Community Board', 'Community Council ', 'Census Tract',
       'BIN', 'BBL', 'NTA'],
      dtype='object')

In [12]:
#Check for null values
print('Let\'s check for null values\n')
print(fdny.isnull().sum())

Let's check for null values

FacilityName          0
FacilityAddress       0
Borough               0
Postcode              5
Latitude              5
Longitude             5
Community Board       5
Community Council     5
Census Tract          5
BIN                   5
BBL                   5
NTA                   5
dtype: int64

In [13]:
#Drop NaN rows from RainToday column
fdny.dropna(subset=['Postcode'],inplace=True)
fdny.shape

(213, 12)

In [17]:
#Sorting the results in asending order by Postcode
fdny.sort_values(['Postcode'], ascending = True).head()

                       FacilityName  ...                                                NTA
18               Engine 1/Ladder 24  ...  Midtown-Midtown South                         ...
6   Engine 15/Ladder 18/Battalion 4  ...  Lower East Side                               ...
5                 Engine 9/Ladder 6  ...  Chinatown                                     ...
8                          Engine 5  ...  East Village                                  ...
19                        Engine 14  ...  Hudson Yards-Chelsea-Flatiron-Union Square    ...

[5 rows x 12 columns]

In [16]:
#View results of Borough column
print('Let\'s take a look at a non-numerical columns')
print(fdny.Borough.unique())

Let's take a look at a non-numerical columns
['Manhattan' 'Bronx' 'Brooklyn' 'Queens' 'Staten Island']

In [18]:
fdny['Borough'].value_counts(ascending = False)

Brooklyn         64
Queens           48
Manhattan        47
Bronx            34
Staten Island    20
Name: Borough, dtype: int64

In [20]:
fdny.groupby(['Borough']).Postcode.value_counts(ascending = False).head()

Borough  Postcode
Bronx    10457.0     5
         10456.0     3
         10452.0     2
         10453.0     2
         10455.0     2
Name: Postcode, dtype: int64

In [21]:
#How many unique postcodes are there per Borough?
fdny.groupby(['Borough'])['Postcode'].nunique()

Borough
Bronx            21
Brooklyn         36
Manhattan        31
Queens           41
Staten Island    12
Name: Postcode, dtype: int64

In [22]:
#How many unique latitudes and longitudes are there per Borough?
fdny.groupby(['Borough'])['Latitude','Longitude'].nunique()

               Latitude  Longitude
Borough
Bronx                34         34
Brooklyn             64         64
Manhattan            47         47
Queens               48         48
Staten Island        20         20

In [23]:
#Rename a column in dataset
fdny = fdny.rename(columns={'FacilityName':'Facility Name'}, inplace=False)
#Creates a data frame of only the columns listed
fdny[['Facility Name']].head()

                                       Facility Name
0                                 Engine 4/Ladder 15
1                                Engine 10/Ladder 10
2                                           Engine 6
3  Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...
4                                           Ladder 8

In [24]:
#There are two ways to get a column of a dataframe. One way is fdny.['COLUMN_NAME'] and the other way is fdny.COLUMN_NAME. You can also get multiple columns using fdny[['column1', 'column2']]
fdny[['Facility Name', 'Borough']].head()

                                       Facility Name    Borough
0                                 Engine 4/Ladder 15  Manhattan
1                                Engine 10/Ladder 10  Manhattan
2                                           Engine 6  Manhattan
3  Engine 7/Ladder 1/Battalion 1/Manhattan Boroug...  Manhattan
4                                           Ladder 8  Manhattan

In [25]:
#Select the Boroughs that start with S
fdny[fdny.Borough.str.startswith('S')].head(10)

              Facility Name  ...                                                NTA
198                Marine 9  ...  West New Brighton-New Brighton-St. George     ...
199    Engine 155/Ladder 78  ...  West New Brighton-New Brighton-St. George     ...
200  Ladder 79/Battalion 22  ...  West New Brighton-New Brighton-St. George     ...
201              Engine 156  ...  West New Brighton-New Brighton-St. George     ...
202    Engine 163/Ladder 83  ...  Westerleigh                                   ...
203    Engine 153/Ladder 77  ...  Stapleton-Rosebank                            ...
204    Engine 165/Ladder 85  ...  Todt Hill-Emerson Hill-Heartland Village-Light...
205    Engine 157/Ladder 80  ...  Port Richmond                                 ...
206              Engine 158  ...  Mariner's Harbor-Arlington-Port Ivory-Granitev...
207    Engine 166/Ladder 86  ...  New Springville-Bloomfield-Travis             ...

[10 rows x 12 columns]